Harvester.Core/Service References/ScholarlyIQSushi/SushiService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="SushiService" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="SushiService" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema targetNamespace="SushiService/Imports">
      <xsd:import schemaLocation="http://sushi4.scholarlyiq.com/SushiService.svc?xsd=xsd0" namespace="http://www.niso.org/schemas/sushi/counter" />
      <xsd:import schemaLocation="http://sushi4.scholarlyiq.com/SushiService.svc?xsd=xsd1" namespace="http://www.niso.org/schemas/sushi" />
      <xsd:import schemaLocation="http://sushi4.scholarlyiq.com/SushiService.svc?xsd=xsd2" namespace="http://www.niso.org/schemas/counter" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="GetReportRequest">
    <wsdl:part xmlns:q1="http://www.niso.org/schemas/sushi/counter" name="ReportRequest" element="q1:ReportRequest" />
  </wsdl:message>
  <wsdl:message name="GetReportResponse">
    <wsdl:part xmlns:q2="http://www.niso.org/schemas/sushi/counter" name="ReportResponse" element="q2:ReportResponse" />
  </wsdl:message>
  <wsdl:portType name="ISushiService">
    <wsdl:operation name="GetReport">
      <wsdl:input wsaw:Action="SushiService:GetReportIn" name="GetReportRequest" message="tns:GetReportRequest" />
      <wsdl:output wsaw:Action="SushiService:GetReportIn" name="GetReportResponse" message="tns:GetReportResponse" />
    </wsdl:operation>
  </wsdl:portType>
</wsdl:definitions>